In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df_flight = pd.read_csv("Customer Flight Activity.csv")    #no utilizo index_col = 0 porque loyalty number sino pasaria a ser el indice

In [3]:
df_loyalty = pd.read_csv("Customer Loyalty History.csv")

Fase 1: Exploración y Limpieza "Customer Flight Activity.csv"

 . Exploración Inicial:  ``2. Estructura y características del DataFrame`` ``3. Análisis de valores en columnas`` ``4. Manejo de valores nulos y duplicados``

In [4]:
df_flight

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0
...,...,...,...,...,...,...,...,...,...,...
405619,999902,2018,12,0,0,0,0,0.0,0,0
405620,999911,2018,12,0,0,0,0,0.0,0,0
405621,999940,2018,12,3,0,3,1233,123.0,0,0
405622,999982,2018,12,0,0,0,0,0.0,0,0
405623,999986,2018,12,0,0,0,0,0.0,0,0

In [5]:
df_flight.head()  #primeras filas

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0

In [6]:
df_flight.sample(15)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
335503,863490,2018,8,0,0,0,0,0.00,0,0
83798,265566,2017,7,8,8,16,4000,400.00,534,43
127752,603545,2017,8,7,0,7,4487,448.00,0,0
252339,712130,2018,2,1,0,1,2535,273.24,0,0
109220,309364,2018,8,15,3,18,5040,504.00,740,60
119780,179719,2017,8,0,0,0,0,0.00,0,0
286266,944541,2018,5,0,0,0,0,0.00,0,0
116386,896853,2017,7,0,0,0,0,0.00,0,0
93171,562361,2017,6,0,0,0,0,0.00,0,0
44404,664112,2017,3,0,0,0,0,0.00,0,0
111455,634185,2017,7,0,0,0,0,0.00,0,0
339148,161276,2018,9,5,0,5,2790,279.00,0,0
375474,296217,2018,11,7,5,12,1236,123.00,0,0
220814,159751,2018,2,0,0,0,0,0.00,0,0
187863,509474,2018,6,20,0,20,3520,352.00,0,0

In [7]:
df_flight.shape #Devuelve el número de filas y columnas. tamaño

(405624, 10)

In [8]:
#Proporciona información general del DataFrame, incluyendo tipos de datos y valores nulos. # Obtener información general del DataFrame

df_flight.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 10 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(9)
memory usage: 30.9 MB

In [9]:
# Verificar valores nulos en cada columna a partir del método .isnull().sum()


df_flight.isnull().sum()

Loyalty Number                 0
Year                           0
Month                          0
Flights Booked                 0
Flights with Companions        0
Total Flights                  0
Distance                       0
Points Accumulated             0
Points Redeemed                0
Dollar Cost Points Redeemed    0
dtype: int64

In [10]:
# Verificar cantidad de valores únicos por columna, devuelve el número de valores únicos en una columna o df, es decir, la cantidad de valores diferentes sin contar los repetidos.

df_flight.nunique()

Loyalty Number                 16737
Year                               2
Month                             12
Flights Booked                    22
Flights with Companions           12
Total Flights                     33
Distance                        4746
Points Accumulated              1549
Points Redeemed                  587
Dollar Cost Points Redeemed       49
dtype: int64

In [11]:
#es un atajo para transponer el DataFrame o Series. Esto significa que convierte las filas en columnas y las columnas en filas. 
                        
df_flight.describe().T

#Usar .T en Pandas transpone el resultado de describe(), convirtiendo las estadísticas en columnas y las variables en filas, 
#lo que facilita la comparación de las estadísticas entre columnas. 
#Es útil cuando hay muchas columnas, ya que mejora la visualización y organización de los datos.

#No pongo (include='object'), generalmente ocurre cuando no hay columnas de tipo objeto (categóricas) en tu DataFrame

,count,mean,std,min,25%,50%,75%,max
Loyalty Number,405624.0,550037.873084,258935.286969,100018.0,326961.00,550834.0,772194.00,999986.0
Year,405624.0,2017.500000,0.500001,2017.0,2017.00,2017.5,2018.00,2018.0
Month,405624.0,6.500000,3.452057,1.0,3.75,6.5,9.25,12.0
Flights Booked,405624.0,4.115052,5.225518,0.0,0.00,1.0,8.00,21.0
Flights with Companions,405624.0,1.031805,2.076869,0.0,0.00,0.0,1.00,11.0
Total Flights,405624.0,5.146858,6.521227,0.0,0.00,1.0,10.00,32.0
Distance,405624.0,1208.880059,1433.155320,0.0,0.00,488.0,2336.00,6293.0
Points Accumulated,405624.0,123.692721,146.599831,0.0,0.00,50.0,239.00,676.5
Points Redeemed,405624.0,30.696872,125.486049,0.0,0.00,0.0,0.00,876.0
Dollar Cost Points Redeemed,405624.0,2.484503,10.150038,0.0,0.00,0.0,0.00,71.0

archivo flight

Points Accumulated

archivo loyalty

Salary	

Cancellation Year	

Cancellation Month

Fase 1: Exploración y Limpieza "Customer Loyalty History.csv"

 . Exploración Inicial:  ``2. Estructura y características del DataFrame`` ``3. Análisis de valores en columnas`` ``4. Manejo de valores nulos y duplicados``

In [12]:
df_loyalty

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16732,823768,Canada,British Columbia,Vancouver,V6E 3Z3,Female,College,NaN,Married,Star,61850.19,Standard,2012,12,NaN,NaN
16733,680886,Canada,Saskatchewan,Regina,S1J 3C5,Female,Bachelor,89210.0,Married,Star,67907.27,Standard,2014,9,NaN,NaN
16734,776187,Canada,British Columbia,Vancouver,V5R 1W3,Male,College,NaN,Single,Star,74228.52,Standard,2014,3,NaN,NaN
16735,906428,Canada,Yukon,Whitehorse,Y2K 6R0,Male,Bachelor,-57297.0,Married,Star,10018.66,2018 Promotion,2018,4,NaN,NaN
16736,652627,Canada,Manitoba,Winnipeg,R2C 0M5,Female,Bachelor,75049.0,Married,Star,83325.38,Standard,2015,12,2016.0,8.0

In [13]:
df_loyalty.head()  #primeras filas

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [14]:
df_loyalty.sample(15)

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
15732,835779,Canada,Ontario,Toronto,M2Z 4K1,Male,Bachelor,69696.0,Single,Star,11009.13,Standard,2014,10,NaN,NaN
16231,576587,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,91646.0,Single,Star,16548.86,Standard,2013,6,NaN,NaN
13407,240330,Canada,Ontario,Toronto,M2M 7K8,Female,College,NaN,Married,Star,5152.82,Standard,2014,6,NaN,NaN
14334,589074,Canada,Quebec,Montreal,H2T 2J6,Female,College,NaN,Single,Nova,6414.08,2018 Promotion,2018,4,2018.0,8.0
6618,684386,Canada,British Columbia,Whistler,V6T 1Y8,Female,Bachelor,72409.0,Married,Nova,5380.90,Standard,2012,9,NaN,NaN
4355,305100,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,67036.0,Married,Nova,2824.85,Standard,2014,1,NaN,NaN
11463,366537,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,2652.29,Standard,2016,3,NaN,NaN
11620,275846,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,48073.0,Divorced,Star,6874.33,2018 Promotion,2018,3,NaN,NaN
8486,491495,Canada,Quebec,Montreal,H2Y 2W2,Male,Bachelor,59273.0,Married,Nova,9199.39,Standard,2018,12,NaN,NaN
14324,528712,Canada,British Columbia,Vancouver,V6E 3D9,Female,Bachelor,88252.0,Single,Star,6769.00,Standard,2017,6,NaN,NaN
836,287593,Canada,British Columbia,Vancouver,V1E 4R6,Female,Bachelor,77464.0,Single,Aurora,5071.65,Standard,2013,7,NaN,NaN
16021,603744,Canada,British Columbia,Whistler,V6T 1Y8,Female,College,NaN,Married,Star,13786.70,Standard,2014,2,NaN,NaN
629,416620,Canada,Quebec,Montreal,H2Y 4R4,Male,Bachelor,58863.0,Married,Star,4862.91,Standard,2018,9,NaN,NaN
4284,529415,Canada,Ontario,Toronto,M2M 7K8,Female,Bachelor,71335.0,Married,Nova,2790.68,Standard,2015,8,NaN,NaN
6002,381065,Canada,Manitoba,Winnipeg,R2C 0M5,Male,Bachelor,87635.0,Married,Nova,4669.23,Standard,2015,8,2017.0,3.0

In [15]:
df_loyalty.shape #Devuelve el número de filas y columnas. tamaño

(16737, 16)

In [16]:
#Proporciona información general del DataFrame, incluyendo tipos de datos y valores nulos. # Obtener información general del DataFrame

df_loyalty.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16737 entries, 0 to 16736
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Loyalty Number      16737 non-null  int64
 1   Country             16737 non-null  object
 2   Province            16737 non-null  object
 3   City                16737 non-null  object
 4   Postal Code         16737 non-null  object
 5   Gender              16737 non-null  object
 6   Education           16737 non-null  object
 7   Salary              12499 non-null  float64
 8   Marital Status      16737 non-null  object
 9   Loyalty Card        16737 non-null  object
 10  CLV                 16737 non-null  float64
 11  Enrollment Type     16737 non-null  object
 12  Enrollment Year     16737 non-null  int64
 13  Enrollment Month    16737 non-null  int64
 14  Cancellation Year   2067 non-null   float64
 15  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(3), object(9)
memory usage: 2.0+ MB

In [17]:
# Verificar valores nulos en cada columna a partir del método .isnull().sum()

df_loyalty.isnull().sum()

Loyalty Number            0
Country                   0
Province                  0
City                      0
Postal Code               0
Gender                    0
Education                 0
Salary                 4238
Marital Status            0
Loyalty Card              0
CLV                       0
Enrollment Type           0
Enrollment Year           0
Enrollment Month          0
Cancellation Year     14670
Cancellation Month    14670
dtype: int64

In [18]:
# Verificar cantidad de valores únicos por columna, devuelve el número de valores únicos en una columna o df, es decir, la cantidad de valores diferentes sin contar los repetidos.

df_loyalty.nunique()

Loyalty Number        16737
Country                   1
Province                 11
City                     29
Postal Code              55
Gender                    2
Education                 5
Salary                 5890
Marital Status            3
Loyalty Card              3
CLV                    7984
Enrollment Type           2
Enrollment Year           7
Enrollment Month         12
Cancellation Year         6
Cancellation Month       12
dtype: int64

In [19]:
#es un atajo para transponer el DataFrame o Series. Esto significa que convierte las filas en columnas y las columnas en filas. 
                        
df_loyalty.describe().T

#Usar .T en Pandas transpone el resultado de describe(), convirtiendo las estadísticas en columnas y las variables en filas, 
#lo que facilita la comparación de las estadísticas entre columnas. 
#Es útil cuando hay muchas columnas, ya que mejora la visualización y organización de los datos.

#No pongo (include='object'), generalmente ocurre cuando no hay columnas de tipo objeto (categóricas) en tu DataFrame

,count,mean,std,min,25%,50%,75%,max
Loyalty Number,16737.0,549735.880445,258912.132453,100018.00,326603.00,550434.00,772019.00,999986.00
Salary,12499.0,79245.609409,35008.297285,-58486.00,59246.50,73455.00,88517.50,407228.00
CLV,16737.0,7988.896536,6860.982280,1898.01,3980.84,5780.18,8940.58,83325.38
Enrollment Year,16737.0,2015.253211,1.979111,2012.00,2014.00,2015.00,2017.00,2018.00
Enrollment Month,16737.0,6.669116,3.398958,1.00,4.00,7.00,10.00,12.00
Cancellation Year,2067.0,2016.503145,1.380743,2013.00,2016.00,2017.00,2018.00,2018.00
Cancellation Month,2067.0,6.962748,3.455297,1.00,4.00,7.00,10.00,12.00

Unión los dos datos de los DataFrame de la forma más eficiente

In [20]:
df_union = pd.concat([df_flight, df_loyalty], axis=0, ignore_index=True)

In [21]:
df_union

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,...,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,100018,2017.0,1.0,3.0,0.0,3.0,1521.0,152.0,0.0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,100102,2017.0,1.0,10.0,4.0,14.0,2030.0,203.0,0.0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,100140,2017.0,1.0,6.0,0.0,6.0,1200.0,120.0,0.0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,100214,2017.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,100272,2017.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
422356,823768,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,College,NaN,Married,Star,61850.19,Standard,2012.0,12.0,NaN,NaN
422357,680886,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,Bachelor,89210.0,Married,Star,67907.27,Standard,2014.0,9.0,NaN,NaN
422358,776187,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,College,NaN,Single,Star,74228.52,Standard,2014.0,3.0,NaN,NaN
422359,906428,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,Bachelor,-57297.0,Married,Star,10018.66,2018 Promotion,2018.0,4.0,NaN,NaN
422360,652627,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,Bachelor,75049.0,Married,Star,83325.38,Standard,2015.0,12.0,2016.0,8.0

In [23]:
df_union.columns

Index(['Loyalty Number', 'Year', 'Month', 'Flights Booked',
       'Flights with Companions', 'Total Flights', 'Distance',
       'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed',
       'Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education',
       'Salary', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type',
       'Enrollment Year', 'Enrollment Month', 'Cancellation Year',
       'Cancellation Month'],
      dtype='object')

In [24]:
df_merge = pd.merge(df_flight, df_loyalty, on='Loyalty Number', how='outer')

In [25]:
df_merge

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,...,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,100018,2017,1,3,0,3,1521,152.0,0,0,...,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
1,100018,2017,2,2,2,4,1320,132.0,0,0,...,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
2,100018,2018,10,6,4,10,3110,311.0,385,31,...,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
3,100018,2017,4,4,0,4,924,92.0,0,0,...,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
4,100018,2017,5,0,0,0,0,0.0,0,0,...,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
405619,999986,2018,7,15,0,15,1995,199.0,0,0,...,Bachelor,46594.0,Married,Nova,8257.01,2018 Promotion,2018,2,NaN,NaN
405620,999986,2018,9,0,0,0,0,0.0,0,0,...,Bachelor,46594.0,Married,Nova,8257.01,2018 Promotion,2018,2,NaN,NaN
405621,999986,2018,10,6,0,6,708,70.0,0,0,...,Bachelor,46594.0,Married,Nova,8257.01,2018 Promotion,2018,2,NaN,NaN
405622,999986,2018,11,11,4,15,2040,204.0,0,0,...,Bachelor,46594.0,Married,Nova,8257.01,2018 Promotion,2018,2,NaN,NaN
405623,999986,2018,12,0,0,0,0,0.0,0,0,...,Bachelor,46594.0,Married,Nova,8257.01,2018 Promotion,2018,2,NaN,NaN